app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("amount", "source_wallet_id", "target_wallet_id", "transaction_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["amount", 100.0], ["source_wallet_id", nil], ["target_wallet_id", 2], ["transaction_type", "credit"], ["created_at", "2024-09-22 07:58:55.613013"], ["updated_at", "2024-09-22 07:58:55.613013"]]
---
    def create
      @transaction = Transaction.new(transaction_params)

      if @transaction.save