app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "email", "name", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2024-09-22 08:53:43.510682"], ["updated_at", "2024-09-22 08:53:43.510682"], ["email", "[FILTERED]"], ["name", nil], ["password_digest", "[FILTERED]"]]