app/models/transaction.rb

UPDATE "wallets" SET "balance" = COALESCE("balance", 0) + ? WHERE "wallets"."id" = ?  [["balance", 100.0], ["id", 2]]
UPDATE "wallets" SET "balance" = COALESCE("balance", 0) - ? WHERE "wallets"."id" = ?  [["balance", 50.0], ["id", 1]]
---
    def update_wallet_balances
      Wallet.transaction do
        if transaction_type == 'credit'
          target_wallet.increment!(:balance, amount)
        elsif transaction_type == 'debit'
          source_wallet.decrement!(:balance, amount)